#pragma once

/////////////////////////////////////////////////////////////////
//                                                             //
//                   Динамический массив                       //
//                                                             //
/////////////////////////////////////////////////////////////////

//-------------------//
// Структура массива //
//-------------------//
typedef struct Array_tag{

	int *p;
	int size;
	
} Array;

/////////////////////////////////////////////////////////////////
//                                                             //
//                     Префиксное дерево                       //
//                                                             //
/////////////////////////////////////////////////////////////////

//---------------------------//
// Структура вершины словаря //
//---------------------------//
typedef struct Vertex_Tag{

	_Bool haveEnd;                 //Имеется ли здесь конец слова
	char c;						   //Символ в вершине
	int howManyChildren;		   //Количенство потомков
	struct Vertex_Tag **children;  //Массив указателей на потомков
	
} Vertex;

//------------------------------//
// Структура префиксного дерева //
//------------------------------//
typedef struct{

	Vertex *root; //Указатель на корневую вершину
	
} Trie;

/////////////////////////////////////////////////////////////////
//                                                             //
//                      Бинарное дерево                        //
//                                                             //
/////////////////////////////////////////////////////////////////

//----------------------//
// Структура би-вершины //
//----------------------//
typedef struct BiVertex_Tag{

	int value;					     //Значение в вершине
	int leftHeight;                  //Высота левого поддерева
	int rightHeight;                 //Высота правого поддерева
	struct BiVertex_Tag *leftChild;  //Указатель на левого потомка
	struct BiVertex_Tag *rightChild; //Указатель на правого потомка
	
} BiVertex;

//---------------------//
// Структура би-дерева //
//---------------------//
typedef struct{

	BiVertex *root; //Указатель на корневую вершину
	
} BiTree;
